""" Модуль для выполнения дз по теме ООП (базовый уровень)

    Задача: Реализовать техническое задание ниже.

    ТЕХ. ЗАДАНИЕ:
        У нас есть отель, в котором есть номера разных типов (от Room):
        Обычный номер
        Люкс (имеет мультипликатор цены)
        Гость может:
        бронировать номер на определённые даты - через класс Booking - бронирование. Его можно отменить.
        Отель (класс Hotel) должен:
        уметь показывать список доступных номеров на заданные даты;
        добавить номер
        забронировать и отменить бронирование
        показать забронированные номера
"""
